MENU = {                    # 다 하신 분들은 카푸치노의 커피 소모량을 콘솔에 출력하시오.
    "에스프레소": {
        "재료": {
            "물": 50,
            "커피": 18,
        },
        "가격": 1.5,
    },
    "카푸치노": {
        "재료": {
            "물": 250,
            "우유": 100,
            "커피": 24,
        },
        "가격": 3.0,
    },
    "라떼": {
        "재료" : {
            "물": 200,
            "우유": 150,
            "커피": 24,
        },
        "가격": 2.5,
    },
}

profit = 0

# 에스프레소의 가격만큼 profit을 증가시키고 print(profit)이라고 했을 때 1.5가 출력될 수 있도록 print()문을 작성하시오.
# profit += MENU["에스프레소"]["가격"]
# print(profit)
resources = {
    "물": 300,
    "우유": 200,
    "커피": 100,
}

# 라떼를 주문하면 생기는 물/커피/우유의 소모량만큼 resources에서 빼고, print(resources)를 했을 때 그 결과가 반영되도록 코드를 작성하시오.
# 또한 라떼를 주문했기 때문에 profit에 라떼 가격만큼 증가시켜 print(profit)을 통해 2.5달러를 출력하시오.

# resources["물"] -= MENU["라떼"]["재료"]["물"]
# resources["우유"] -= MENU["라떼"]["재료"]["우유"]
# resources["커피"] -= MENU["라떼"]["재료"]["커피"]
# print(resources)
# profit += MENU["라떼"]["가격"]
# print(profit)
# 근데 resources 마이너스 시키는 부분을 확인해보면 얘가 포켓몬 할 때처럼 index가 아닐 뿐이지 기본적으로 반복이 된다는 사실을 알 수 있습니다. -> key를 기준으로.

# print(resources)
# for stuff in resources:
#     # print(stuff, end=" / ")
#     resources[stuff] -= MENU["라떼"]["재료"][stuff] #라떼의재료의물/우유/커피를 의미하는 코드만 써주면
#
# print(resources)

# 함수 정의 영역
def is_resources_enough(order_ingredients):     # MENU[choice]["재료"]
    """"DocString : 함수/클래스/메서드가 어떤 작동을 하는지 '사람들에게' 설명해주는 기능
    주문 받은 음료를 resources에서 재료 차감을 하고 난 후, 음료 만들기가 가능하면 True 반환, 아니면 False 반환
    :param: order_ingredients
    :return: True / False
     """""
    for item in order_ingredients:      #MENU[choice]["재료"]가 반복돌아갔으니까 물/우유/커피 가 나옵니다.
        if resources[item] < order_ingredients[item]:
            print(f"죄송합니다. {item}이(가) 부족합니다. 🙏")
            return False
    return True     #위의 조건문이 실행이 안된다면 전체 재료가 충분히 있으므로 True 리턴

is_on = True
while is_on:
    choice = input("어떤 음료를 드시겠습니까? 에스프레소/라떼/카푸치노 >>> ")
    # 만약에 choice가 "off"라면 자판기 종료 메시지를 출력하고 종료.
    if choice == "off":
        print("자판기가 종료되었습니다. ⭐")
        is_on = False
    # "report"라면 현재 자판기의 물 / 우유 / 커피의 양과 돈의 양을 보여줄 것
    elif choice == "report":
        print(f"물 : {resources["물"]} ml\n우유: {resources["우유"]} ml\n커피: {resources["커피"]} g\n돈 : $ {profit}")
    # choice가 에스프레소 / 라떼 / 카푸치노 중 하나라면
    elif choice in ["에스프레소", "라떼", "카푸치노"]:
        drink = MENU[choice]
        if is_resources_enough(drink["재료"]):
            print("동전을 입력 받아서 연산한 결과값을 내는 로직 -> 동전이 커피 금액보다 작으면 실패해야겠네요")
    else:
        print("잘못 입력하셨습니다. 다시 입력하세요. ❤️")









